{
	"title" : "LIDAR Videography",
	"client" : "self",
	"role" : "all",
	"description" : "LIDAR is a range-sensing technology typically employed by the government and military to survey land from above. By measuring the time of flight of modulated pulses of light, depth can be extracted from a scene, often to very high precision.\n\nFrom surreptitiously slit-scanning streets packed with bar-goers at 2 in the morning to arresting the beauty of bamboo forests in northern Virginia with handmade rigs, I’ve continued to have a conversation with this piece of technology in hopes of exploring how it sees the world.\n\nThe artifacts produced through the process of capture, including the bounce of my gait, the elongation or compression of figures, the casting of shadows and the existence of black holes, reveal a deep interconnectedness between observer and observed.\n\nEach of the videos here represent a capture or series of captures. Specific processes are described in further detail below each.\n\n. . .\n\n<i>Recording and rendering possible with custom software I built in C++ (OpenFrameworks).\n\nMany thanks to Golan Levin and Dan Moore (for his <a href='https://github.com/danzeeeman/ofxUrg' target='blank'>ofxURG</a> addon).</i>",
	"date" : "2016",

	"globalExt" : "jpg",
	"numDigits" : 3,
	"images" : [
		"240243710_692_389",
		"152925908_692_389",
		"153359075_692_433",
		"144993841_692_389",
		"145215259_692_389",
		"151335007_692_389",
		1,
		3,
		7,
		6,
		4,
		[15, 13],
		14
	],
	"captions" : {
		"240243710" : "<i>Bamboo Forest</i>. A single 360 degree capture is animated in the round with a slight perlin noise added to each dot for airiness and atmosphere. The large black hole in the center represents the 'blind spot' of the sensor. Each capture is comrpised of hundreds of linear scans, stacked together into a spherical scan.",
		"152925908" : "<i>Sleeping</i>. Here, a single night of sleep is compressed into thirteen seconds. This timelapse is built from five hundred individual spherical frames. During capture, the LIDAR remains stationary, but the camera's movement is set in post-production.",
		"153359075" : "<i>Cafe</i>. A LIDAR timelapse captures the afternoon happenings in a cafe. Notice how people cast shadows in the same way a single flame would light the walls.",
		"144993841" : "<i>Southside Alleys</i>. Attaching the LIDAR device to my car and driving through alleys at night produces these ominous slit-scanned time-scapes. Buildings, trees, cars and fire hydrants are visible as series of stacked outlines. Each line represents a single linear scan.",
		"145215259" : "<i>Carson Street</i>. This slit-scan is produced by hiding the LIDAR in my backpack and walking down a street packed with people in the early morning. Bodies appear elongated at times and compressed at others, depending on whether they were walking with or against me, respectively.",
		"151335007" : "<i>Temporalized Hallway</i>. This capture was made in collaboration with the Carnegie Museum of Art. These scans were taken in a hallway, with people walking in both directions. However, everyone faces the same direction in the scan. This is because we all walk forwards, not backwards, in time.",
		"1" : "Custom rig I built that turns a two-dimensional LIDAR into a three-dimensional scanner.",
		"3" : "Components needed for capture: The rig is controlled by an Arduino, while the LIDAR communicates with the computer over USB.",
		"7" : "Scanning a forest in the Blue Ridge Mountains with my portable scanner.",
		"6" : "LIDAR hidden inside backpack: Used for clandestine street captures.",
		"4" : "LIDAR mounted to car: Used for scanning buildings and urban environments.",
		"15" : "Exploded view of the scanning rig.",
		"14" : "Description of how the rig uses a planar LIDAR to scan full 3D environments."
	}
}